{"topicId":"9006183","articleName":"View & manage data","articleDescription":"Access Usage Manager to view data usage, set data limits, and see the apps using the most data.","id":"interactive_1500001423","steps":{"step":[{"stepOrder":"1","stepContent":"To check and manage data usage, from the home screen, tap <strong>Settings<\/strong>.","stepNote":"To check your current month&#39;s data usage dial <strong>*data#<\/strong> (<strong>*3282#<\/strong>) on your mobile phone to receive a text message with the current bill cycle&#39;s usage.","imageLocation":"5015/9006183_01.jpg","frame":[2,20]},{"stepOrder":"2","stepContent":"Tap <strong>Cellular<\/strong>.","imageLocation":"5015/9006183_02.jpg","frame":[20,24]},{"stepOrder":"3","stepContent":"Scroll to view a list of apps and the amount of cellular data they have used.","stepNote":"The amount of data displayed is the amount used since the statistics were last reset. To reset the statistics, scroll to the bottom, then tap <strong>Reset Statistics<\/strong>.","imageLocation":"5015/9006183_03.jpg","frame":[24,41]},{"stepOrder":"4","stepContent":"To disable cellular data usage for an app, tap the <strong>Cellular data switch<\/strong> next to the app name.","stepNote":"Learn more from Apple support article: <a href=\"https://support.apple.com/en-us/HT201299\">Learn about cellular data settings and usage on your iPhone<\/a>","imageLocation":"5015/9006183_04.jpg","frame":[41,55]},{"stepOrder":"5","stepContent":"To turn <strong>Wi-Fi Assist<\/strong> (automatically use cellular data when Wi-Fi connectivity is poor) on or off, scroll to the bottom of the page, then tap the <strong>Wi-Fi Assist switch<\/strong>. &nbsp;<br />","stepNote":"Wi-Fi Assist regularly checks the Wi-Fi connection to determine signal strength. If the Wi-Fi signal strength drops below a specific range, Wi-Fi Assist will automatically switch the session to cellular data until the Wi-Fi signal improves. &nbsp;Wi-Fi Assist is an optional setting that is turned on by default and can be turned off at any time. Data rates apply for cellular connections. Learn more from Apple support article: <a href=\"https://support.apple.com/en-us/HT205296\">About Wi-Fi Assist<\/a>","imageLocation":"5015/9006183_05.jpg","frame":[55,57]}]},"url":"http://www.att.com/devicehowto/index.jsp?id=interactive_1500001423&make=Apple&model=Apple6sPlus"}
